app/controllers/kittens_controller.rb

  def create
    @kitten = Kitten.new(kitten_params)
    if @kitten.save
---
INSERT INTO "kittens" ("name", "age", "cuteness", "softness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dog"], ["age", 2], ["cuteness", 1], ["softness", 0], ["created_at", "2017-07-01 14:07:00.707000"], ["updated_at", "2017-07-01 14:07:00.707000"]]

  def edit
    @kitten = Kitten.find(params[:id])
---
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @kitten = Kitten.find(params[:id])
    if @kitten.update_attributes(kitten_params)
---
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "kittens" SET "name" = ?, "age" = ?, "cuteness" = ?, "softness" = ?, "updated_at" = ? WHERE "kittens"."id" = ?  [["name", "Rabbit"], ["age", 1], ["cuteness", 10], ["softness", 10], ["updated_at", "2017-07-01 14:04:16.005000"], ["id", 1]]

  def destroy
    Kitten.find(params[:id]).destroy
---
DELETE FROM "kittens" WHERE "kittens"."id" = ?  [["id", 2]]
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def index
    @kittens = Kitten.all
---
SELECT "kittens".* FROM "kittens"

  def show
    @kitten = Kitten.find(params[:id])
---
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]